def main():
    result = None

    try: 
        # a. 문자열 자르기 --> 리스트를 얻게 됨.
        temp3="74 874 9883 73 9 73646 774"
        문자열리스트=temp3.split(" ")
        print(문자열리스트)
        
        # b. 문자열을 정수 리스트로 만든다.
        print( 문자열리스트[0], type(문자열리스트[0])) #=> "74"
        print( 문자열리스트[0], type(문자열리스트[0])) #=> "874"
        print( 문자열리스트[0], type(문자열리스트[0])) #=> "9883"

        문자열리스트[0], int(문자열리스트[0]) #"74" ==>74
        문자열리스트[1], int(문자열리스트[1]) #"74" ==>74
        문자열리스트[2], int(문자열리스트[2]) #"74" ==>74

        정수리스트=[]
        for i in 문자열리스트:
            정수=int(i)
            정수리스트.append(정수)
        print(정수리스트)

        # c. 정수리스트를 오름차순 정렬하시오

        정수리스트.sort()

        # d. 정수리스트에서 최대값을 찾는다.
        print(max(정수리스트))

    except Exception as ex:
        print(ex)

    return result

main()
