# 정수를 입력을 받습니다.
# 입력 받은 문자열을 정수로 바꿉니다.
num=int(input("정수를 입력하시오"))

# 숫자로 변환하기


#######################################
# 홀수, 짝수 판별법
# 방법1. 나머지를 사용하는 방법
# 방법2. 문자열을 사용하는 방법
#######################################


#######################################
# 방법1. 나머지를 사용하여 짝수 , 홀수 판별하는 방법
#######################################
# 짝수 확인
if num%2==0:
    print("Even")
else:
    print("Odd")

# 홀수 확인
if num%2==1:
    print("Odd")
print()
print()
print("=================================")
print("방법2")
#######################################
# 방법2. 문자열을 사용하는 방법
#######################################
num=input("숫자를 입력하세요.... " )

if num[-1]=="0" or num[-1]=="2" or num[-1]== "4"  or  num[-1]=="6" or  num[-1]=="8":
    print("Even")
else:
    print("Odd")


# 마지막 자리 숫자를 추출

# 숫자로 변환하기
