# ▪ 순서도1
# 정수를 입력 받고 '시작값' 변수에 저장하시오
# 정수를 입력 받고 '종료값' 변수에 저장하시오
n1 = int(input("시작값은...?::::"))
n2 = int(input("종료값은...?::::"))
r1 = range(n1, n2+1, 1)
eqn = 0
sum1 = sum(r1)

for i in r1:
    if i == n2:
        print(n2, "=", sum1)
    else:
        print(i, "+", end="")


print()

print("=================================================")

시작정수 = int(input("시작값은...?::::"))
종료정수 = int(input("종료값은...?::::"))
차이 = int((종료정수-시작정수)/abs(시작정수-종료정수))
sum = 0
print(차이)
str1 = ""
print(range(시작정수, 종료정수+1, 차이))

for i in range(시작정수, 종료정수+1, 차이):
    sum = sum+i
    str1 = str1+str(i)
    print(i, end="")
    # i가 종료 정수와 같으면 "="을 출력하고 아니면 "+" 출력하시오

    if i == 종료정수:
        str1 = str1+"="
    else:
        str1 = (str1+"+")
        print(str1)

    str1 = str1+str(sum)


#
# 시작값이 종료값보다 크다면
#     i 는 종료값부터 시작값까지 i를 1씩 증가시키면서 합계를 구해하시오
# 아니면
#     i 는 시작값부터 종료값까지 i를 1씩 증가시키면서 합계를 구해하시오
#
# 합계를 출력하시오
#
#
# ▪ 순서도2
# 정수를 입력 받고 '시작값' 변수에 저장하시오
# 정수를 입력 받고 '종료값' 변수에 저장하시오
#
# 시작값이 종료값보다 크다면
#         종료값을  temp에 넣는다.
#         시작값을 종료값 에 넣는다.
#         temp을 시작값에 넣는다.
# 아니면
#
# i 는 시작값부터 종료값까지 i를 1씩 증가시키면서 합계를 구해하시오.
#
# 합계를 출력하시오.


# ▪ 실행결과예시
# 시작값을 입력하세요.  1
# 종료값을 입력하세요.  4
# 1부터 4까지의 합계는 10입니다
#
# ▪ 실행결과예시
# 시작값을 입력하세요.  4
# 종료값을 입력하세요.  1
# 1부터 4까지의 합계는 10입니다
